app/controllers/api/camps_controller.rb

  def show
    @camp = Camp.includes(:bookings).includes(:reviews).includes(:host).with_attached_photos.find(params[:id])
---
SELECT  "camps".* FROM "camps" WHERE "camps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    camps = bounds ? Camp.in_bounds(bounds) : Camp.all
---
SELECT "camps".* FROM "camps"