app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0dpg7bbOufPwYbzVJzoEXQ"], ["updated_at", "2019-11-06 05:56:00.654718"], ["id", 17]]
---
  def reset_session_token!
    self.update!(session_token: SecureRandom.urlsafe_base64)